#+STARTUP: overview
#+latex_class_options: [12pt]

** Example
#+BEGIN_SRC sage :session . :exports both
Z5 = Zmod(5)
Z5
# field has 5 elements
for i in Z5:
  print(i)

# nonzero elements of this field form a multiplicative group of order 4
G5 = Z5.unit_group() # multiplicative group
G5.inject_variables()
G5
for i in G5:
  print(i)

G5.order()

print('---')

# group elements
for i in range(1,5):
    print(Z5(f^i))

print('2-nd roots of unity')
for i in range(1,5):
    elem = Z5(f^i)
    if elem^2 == Z5(1):
      print(elem)

print('4-th roots of unity') # all elements satisfy this property
for i in range(1,5):
    elem = Z5(f^i)
    if elem^4 == Z5(1):
      print(elem)
#+END_SRC

#+RESULTS:
#+begin_example
Ring of integers modulo 5
0
1
2
3
4
Defining f
Multiplicative Abelian group isomorphic to C4
1
f
f^2
f^3
4
---
2
4
3
1
2-nd roots of unity
4
1
4-th roots of unity
2
4
3
1
#+end_example

** Example

In the finite field $\mathbb{F}_7$, the primitive $3$-rd roots of unity can be derived as follows:

1. The elements of $\mathbb{F}_7$ are $\{1, 2, 3, 4, 5, 6\}$.
2. Check which elements satisfy $x^3 = 1$ in $\mathbb{F}_7$.
3. Identify the ones that generate roots distinctly without repetition until reaching $n$.

#+BEGIN_SRC sage :session . :exports both
F = FiniteField(7)

# Find primitive 3rd roots of unity in F_7
n = 3
roots = [x for x in F if x^n == 1 and x != 1]

print(f"Primitive {n}-th roots of unity in F_7: {roots}")
#+END_SRC

#+RESULTS:
: Primitive 3-th roots of unity in F_7: [2, 4]
** Example
$k$ = 64 and $p$ = 137 ($k$ is coprime to $p$):

#+BEGIN_SRC sage :session . :exports both
137.is_prime()

ZZ(64)^ZZ(137) % ZZ(137) == ZZ(64) % ZZ(137)

# k is coprime to p

ZZ(64).gcd(137)
# hence
ZZ(64)^ZZ(137-1) % ZZ(137) == ZZ(1) % ZZ(137)
#+END_SRC

#+RESULTS:
: True
: True
: 1
: True
** Example: (\mathbb{Z},+) to (\mathbb{Z}_{6},+ )
#+BEGIN_SRC sage :session . :exports both
Z=IntegerRing()
Z6=Integers(6)

phi = lambda n: Z6(n)

a = 7
b = 10

lhs = phi(a+b)
rhs = phi(a) + phi(b)

print(f"phi({a}+{b})={lhs} == phi({a})+phi({b})={rhs}: {lhs == rhs}")
#+END_SRC

#+RESULTS:
: phi(7+10)=5 == phi(7)+phi(10)=5: True
** Example: [[id:77d52c07-a41e-42c5-8069-2be5eaf576b2][Elliptic Curve Scalar Multiplication]]

Let $E$ be an elliptic curve defined over a finite field $\mathbb{F}_p$ (with a prime characteristic $p$).
Let $r$ be the order of some subgroup of $E(\mathbb{F}_p)$, and $r \quad | \quad \#E(\mathbb{F}_p)$.
Let $P \in E(\mathbb{F}_p)$ be a point of order $r$.

[[id:77d52c07-a41e-42c5-8069-2be5eaf576b2][Elliptic Curve Scalar Multiplication]] is defined as:

Let $\phi: \mathbb{Z}_{r} \rightarrow <P> \subseteq E(\mathbb{F}_p), \quad \phi(n)=[n]P$

where:

- $[n]P=P + P + \ldots + P (\text{n times})$
- $\mathbb{Z}_r$ is the domain.
- The cyclic [[id:34778683-5d8a-4242-87c5-06fc72f31135][subgroup]] $<P>$ is the codomain.

For all $a,b\in \mathbb{Z}_r$:

$\phi(a+b)=[a+b]P=[a]P +[b]P = \phi(a) + \phi(b)$

#+BEGIN_SRC sage :session . :exports both
p=97
F = GF(p)
E = EllipticCurve(F, [2,3])

P = E.random_point()
while not P.order().is_prime():
  P = E.random_point()

r = P.order()

Zr=Integers(r)

phi = lambda n,P: n*P

a = Zr(1)
b = Zr(2)

lhs = phi((a+b),P)
rhs = phi(a,P) + phi(b,P)

print(f"phi({a}+{b})={lhs} == phi({a})+phi({b})={rhs}: {lhs == rhs}")

# Check bijectivity
image_set = set(phi(n,P) for n in Zr)
print(f"Size of image set: {len(image_set)} (should be {r})")
print("Is bijective?", len(image_set) == r)
#+END_SRC

#+RESULTS:
: phi(1+0)=(30 : 0 : 1) == phi(1)+phi(0)=(30 : 0 : 1): True
: Size of image set: 2 (should be 2)
: Is bijective? True
